app/views/dashboard/index.html.erb

SELECT COUNT(*) FROM `properties` WHERE `properties`.`user_id` = 1
---
                    <span class="text-estate-dark-500">
                      <%= ((current_user.monthly_property_count.to_f / [current_user.monthly_property_limit, 1].max) * 100).round(1) %>%

SELECT COUNT(*) FROM `favorites` WHERE `favorites`.`user_id` = 2
---
            <% if current_user.buyer? %>
              <%= current_user.favorites.count %>

SELECT COUNT(*) FROM `conversations` WHERE (buyer_id = '2' OR owner_id = '2')
---
          <div class="text-2xl font-bold text-estate-secondary-600 mb-2">
            <%= Conversation.for_user(current_user).count %>