app/views/properties/_property_card.html.erb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 ORDER BY `users`.`id` ASC LIMIT 1
---
          </svg>
          <span><%= property.user.email.split('@').first %></span>