app/views/properties/show.html.erb

                <p class="text-sm font-medium text-gray-900">
                  <%= @property.user.email.split('@').first %>
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 ORDER BY `users`.`id` ASC LIMIT 1