app/controllers/conversations_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` IN (3, 1)
---
  def show
    # 相手のメッセージを既読にする
    @conversation.mark_as_read_for!(current_user)

    # メッセージ一覧
    @messages = @conversation.messages
                           .recent
                           .includes(:sender)
                           .limit(50)

    # 新しいメッセージ用のオブジェクト
    @message = @conversation.messages.build

    # 相手ユーザー情報（複数対応）
    @other_users = @conversation.other_users(current_user)
    @other_user = @other_users.first # 後方互換性のため