app/controllers/conversations_controller.rb

  def index
    @conversations = current_user.conversations
                                .includes(:property, :buyer, :owner, :messages)
                                .recent
                                .page(params[:page])
---
SELECT COUNT(*) FROM (SELECT 1 AS one FROM `conversations` WHERE (buyer_id = '1' OR owner_id = '1') LIMIT 20) subquery_for_count
SELECT `messages`.* FROM `messages` WHERE `messages`.`conversation_id` = 1 ORDER BY `messages`.`created_at` DESC LIMIT 1

  def show
    # 相手のメッセージを既読にする
    @conversation.mark_as_read_for!(current_user)

    # メッセージ一覧（ページネーション付き）
    @messages = @conversation.messages
                           .recent
                           .includes(:sender)
                           .page(params[:page])
---
SELECT `messages`.* FROM `messages` WHERE `messages`.`conversation_id` = 1 ORDER BY `messages`.`created_at` ASC LIMIT 50

  def create
    @property = Property.find(params[:property_id])
---
SELECT `properties`.* FROM `properties` WHERE `properties`.`id` = 32 LIMIT 1

  def set_conversation
    @conversation = Conversation.find(params[:id])
---
SELECT `conversations`.* FROM `conversations` WHERE `conversations`.`id` = 1 LIMIT 1

  def find_or_create_conversation(property, buyer, owner)
    # 購入者とオーナーの役割を正しく設定
    actual_buyer = buyer.buyer? ? buyer : owner
    actual_owner = owner.owner? ? owner : buyer

    # 既存の会話を検索
    conversation = Conversation.find_by(
      property: property,
      buyer: actual_buyer,
      owner: actual_owner
    )

    # 存在しない場合は新規作成
    conversation ||= Conversation.create(
      property: property,
      buyer: actual_buyer,
      owner: actual_owner
    )
---
SELECT `conversations`.* FROM `conversations` WHERE `conversations`.`property_id` = 32 AND `conversations`.`buyer_id` = 2 AND `conversations`.`owner_id` = 1 LIMIT 1
INSERT INTO `conversations` (`property_id`, `buyer_id`, `owner_id`, `last_message_at`, `created_at`, `updated_at`) VALUES (32, 2, 1, NULL, '2025-08-14 01:58:08.890511', '2025-08-14 01:58:08.890511')