app/controllers/favorites_controller.rb

  def create
    @favorite = current_user.favorites.build(property: @property)

    if @favorite.save
---
INSERT INTO `favorites` (`user_id`, `property_id`, `created_at`, `updated_at`) VALUES (2, 32, '2025-08-12 05:49:41.790701', '2025-08-12 05:49:41.790701')

  def destroy
    @favorite = current_user.favorites.find_by(property: @property)

    if @favorite&.destroy
---
SELECT `favorites`.* FROM `favorites` WHERE `favorites`.`user_id` = 2 AND `favorites`.`property_id` = 31 LIMIT 1
DELETE FROM `favorites` WHERE `favorites`.`id` = 2

  def index
    @favorite_properties = current_user.favorite_properties
                                      .includes(:user, :tags, images_attachments: :blob)
                                      .where(status: :active)
                                      .order(created_at: :desc)
                                      .limit(20)
---
SELECT `properties`.* FROM `properties` INNER JOIN `favorites` ON `properties`.`id` = `favorites`.`property_id` WHERE `favorites`.`user_id` = 2 AND `properties`.`status` = 0 ORDER BY `properties`.`created_at` DESC LIMIT 20

  def set_property
    @property = Property.find(params[:property_id])
---
SELECT `properties`.* FROM `properties` WHERE `properties`.`id` = 32 LIMIT 1