app/controllers/messages_controller.rb

INSERT INTO `messages` (`conversation_id`, `sender_id`, `content`, `read_at`, `created_at`, `updated_at`) VALUES (1, 2, 'test\n', NULL, '2025-08-14 01:58:38.856507', '2025-08-14 01:58:38.856507')
---
  def create
    @message = @conversation.messages.build(message_params)
    @message.sender = current_user

    if @message.save

SELECT `conversations`.* FROM `conversations` WHERE `conversations`.`id` = 1 LIMIT 1
---
  def set_conversation
    @conversation = Conversation.find(params[:conversation_id])