app/controllers/my_properties_controller.rb

SELECT `properties`.* FROM `properties` WHERE `properties`.`user_id` = 1 ORDER BY `properties`.`created_at` DESC
---
  def index
    @properties = current_user.properties
                             .includes(:tags, images_attachments: :blob)
                             .order(created_at: :desc)