app/controllers/properties_controller.rb

  def index
    @properties = Property.includes(:user, :tags, images_attachments: :blob)
                         .where(status: :active)

    # 検索条件を適用
    @properties = apply_search_filters(@properties)

    # ソート条件を適用
    @properties = apply_sort_order(@properties)

    # ページネーション
    @properties = @properties.page(params[:page])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` IN (53, 52, 51)
SELECT COUNT(*) FROM (SELECT 1 AS one FROM `properties` WHERE `properties`.`status` = 0 LIMIT 12) subquery_for_count
SELECT `properties`.* FROM `properties` WHERE `properties`.`status` = 0 ORDER BY CASE WHEN sale_price IS NOT NULL THEN sale_price ELSE rental_price / 10000 END DESC LIMIT 12

  def show
    @property = Property.includes(:user, :tags, images_attachments: :blob)
                       .find(params[:id])
---
SELECT `properties`.* FROM `properties` WHERE `properties`.`id` = 31 LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1

  def new
    @property = current_user.properties.build
    @tags = Tag.all.group_by(&:category)
---
SELECT `tags`.* FROM `tags`

  def create_from_steps
    # セッションから物件データを取得して正しいパラメータでbuild
    property_params = session[:property_data].slice(
      'title', 'description', 'property_type', 'prefecture', 'city', 'address'
    )

    # 価格データの変換（文字列から数値へ）
    if session[:property_data]['sale_price'].present?
      property_params['sale_price'] = session[:property_data]['sale_price'].to_i
    end

    if session[:property_data]['rental_price'].present?
      property_params['rental_price'] = session[:property_data]['rental_price'].to_i
    end

    @property = current_user.properties.build(property_params)
    @property.status = :active  # デフォルトで募集中にする

    if @property.save
---
INSERT INTO `properties` (`title`, `description`, `sale_price`, `rental_price`, `deposit`, `key_money`, `management_fee`, `prefecture`, `city`, `address`, `nearest_station`, `station_distance`, `property_type`, `building_area`, `land_area`, `rooms`, `construction_year`, `parking`, `floor_plan_image`, `status`, `user_id`, `created_at`, `updated_at`) VALUES ('あ', 'あ', NULL, 12000, NULL, NULL, NULL, '岩手県', 'あ', 'あ', NULL, NULL, 1, NULL, NULL, NULL, NULL, NULL, NULL, 0, 1, '2025-08-12 00:12:37.605992', '2025-08-12 00:12:37.605992')

  def create
    @property = current_user.properties.build(property_params)

    if @property.save
      redirect_to @property, notice: '物件を投稿しました！'
    else
      @tags = Tag.all.group_by(&:category)
---
INSERT INTO `properties` (`title`, `description`, `sale_price`, `rental_price`, `deposit`, `key_money`, `management_fee`, `prefecture`, `city`, `address`, `nearest_station`, `station_distance`, `property_type`, `building_area`, `land_area`, `rooms`, `construction_year`, `parking`, `floor_plan_image`, `status`, `user_id`, `created_at`, `updated_at`) VALUES ('新しい物件', '素晴らしい物件です', 5000, NULL, NULL, NULL, NULL, '東京都', '渋谷区', '1-1-1', NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, NULL, 0, 65, '2025-08-12 10:11:18.898520', '2025-08-12 10:11:18.898520')
SELECT `tags`.* FROM `tags`

  def edit
    @tags = Tag.all.group_by(&:category)
---
SELECT `tags`.* FROM `tags`

  def update
    # 画像削除処理
    handle_image_deletions if params[:property][:delete_image_ids].present?
    handle_floor_plan_deletion if params[:property][:delete_floor_plan] == '1'

    # 画像の処理
    property_attrs = property_params
    handle_image_attachments(property_attrs)

    if @property.update(property_attrs)
---
UPDATE `properties` SET `properties`.`nearest_station` = '', `properties`.`rooms` = '', `properties`.`updated_at` = '2025-08-12 00:17:15.044723' WHERE `properties`.`id` = 32

  def destroy
    @property.destroy
---
DELETE FROM `properties` WHERE `properties`.`id` = 40

  def set_property
    @property = Property.find(params[:id])
---
SELECT `properties`.* FROM `properties` WHERE `properties`.`id` = 31 LIMIT 1