app/models/conversation.rb

UPDATE `conversations` SET `conversations`.`last_message_at` = '2025-08-14 01:58:38.860358', `conversations`.`updated_at` = '2025-08-14 01:58:38.863216' WHERE `conversations`.`id` = 1
UPDATE `messages` SET `messages`.`read_at` = '2025-08-14 01:58:08.924710' WHERE `messages`.`conversation_id` = 1 AND `messages`.`sender_id` != 2 AND `messages`.`read_at` IS NULL
---
  def mark_as_read_for!(user)
    messages.where.not(sender: user).where(read_at: nil).update_all(read_at: Time.current)